test/vcr_cassettes/test_discount_list.yml

---
http_interactions:
- request:
    method: get
    uri: https://sandbox-api.paddle.com/discounts
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - paddlerb/v0.1.4 (github.com/deanpcmad/paddlerb)
      Authorization:
      - Bearer <AUTHORIZATION>
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Wed, 09 Aug 2023 19:05:27 GMT
      content-type:
      - application/json
      transfer-encoding:
      - chunked
      connection:
      - keep-alive
      cache-control:
      - no-store, max-age=0
      content-security-policy:
      - default-src 'none'; frame-ancestors 'none'; base-uri 'none'
      cross-origin-embedder-policy:
      - require-corp
      cross-origin-opener-policy:
      - same-origin
      cross-origin-resource-policy:
      - same-site
      permissions-policy:
      - accelerometer=(),ambient-light-sensor=(),autoplay=(),battery=(),camera=(),display-capture=(),document-domain=(),encrypted-media=(),fullscreen=(),gamepad=(),geolocation=(),gyroscope=(),layout-animations=(self),legacy-image-formats=(self),magnetometer=(),microphone=(),midi=(),oversized-images=(self),payment=(),picture-in-picture=(),publickey-credentials-get=(),speaker-selection=(),sync-xhr=(self),unoptimized-images=(self),unsized-media=(self),usb=(),screen-wake-lock=(),web-share=(),xr-spatial-tracking=()
      pragma:
      - no-cache
      referrer-policy:
      - no-referrer
      request-id:
      - ccbe0407-87af-4225-9452-33a75c94287c
      strict-transport-security:
      - max-age=31536000; includeSubDomains; preload
      x-content-type-options:
      - nosniff
      x-frame-options:
      - deny
      x-permitted-cross-domain-policies:
      - none
      cf-cache-status:
      - DYNAMIC
      server:
      - cloudflare
      cf-ray:
      - 7f4245484eaf76f6-LHR
      content-encoding:
      - gzip
    body:
      encoding: ASCII-8BIT
      string: '{"data":[{"id":"dsc_01h7dtzexhveh8sqfm16b0yw4d","status":"active","description":"10%
        off","enabled_for_checkout":true,"code":"10OFF","type":"percentage","amount":"10","currency_code":null,"recur":false,"maximum_recurring_intervals":null,"usage_limit":null,"restrict_to":null,"expires_at":null,"times_used":0,"created_at":"2023-08-09T19:04:34.481Z","updated_at":"2023-08-09T19:04:34.481Z"},{"id":"dsc_01h7dv1243xervzbkfxkg56cnn","status":"active","description":"$10
        off","enabled_for_checkout":false,"code":null,"type":"flat","amount":"1000","currency_code":"USD","recur":false,"maximum_recurring_intervals":null,"usage_limit":null,"restrict_to":null,"expires_at":null,"times_used":0,"created_at":"2023-08-09T19:05:26.915Z","updated_at":"2023-08-09T19:05:26.915Z"}],"meta":{"request_id":"ccbe0407-87af-4225-9452-33a75c94287c","pagination":{"per_page":50,"next":"https://sandbox-api.paddle.com/discounts?after=dsc_01h7dv1243xervzbkfxkg56cnn","has_more":false,"estimated_total":2}}}'
  recorded_at: Wed, 09 Aug 2023 19:05:27 GMT
recorded_with: VCR 6.2.0
